Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སེམས་བསྐྱེད་དེ། བདག་ཡུན་རིང་པོར་དགེ་བའི་བཤེས་གཉེན་དང་བྲལ་ཞིང་སྡིག་པའི་གྲོགས་པོས་ཟིན་པས་ལེ་ལོ་ཅན། བརྩོན་འགྲུས་ཉམས་པ། སྙོམ་ལས་ཅན། ལྐུག་པས་གསང་ཚིག་དང་། ཡི་གེ་དང་། དོན་དང་། ཚིག་ཏུ་ལྡན་པ་དང་། ཆོས་དང་ཚིག་ཏུ་ལྡན་པ་དང་། མྱ་ངན་ལས་འདས་པ་དང་ལྡན་པ་དང་། འདོད་ཆགས་དང་བྲལ་བ་དང་ལྡན་པ་དང་། འགོག་པ་དང་། ཞི་བ་དང་། རྫོགས་པའི་བྱང་ཆུབ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། མྱ་ངན་ལས་འདས་པ་དང་ལྡན་པ་དང་། ཐམས་ཅད་ལ་བྱ་སྟེ དེ་དག་སྤངས་ནས་དོན་དང་ཚིག་ཏུ་མི་ལྡན་པ་དང་། ཆོས་ཀྱི་ཚིག་དང་མི་ལྡན་པ་ནས། མྱ་ངན་ལས་འདས་པ་དང་མི་ལྡན་པའི་བར་གྱི་ཚིག་དང་། ཡི་གེ་དེ་དག་འཛིན་པ་དང་། ལེན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་ནི་འདི་ལྟ་སྟེ། སྟོབས་མེད། བརྩོན་འགྲུས་མེད། སྐྱེས་བུའི་སྟོབས་མེད། སྐྱེས་བུའི་མཐུ་མེད། སྐྱེས་བུའི་བརྟུལ་བ་མེད། སྤྱོད་པ་མེད། རྟུལ་བ་མེད། ། སྤྱོད་པ་ལ་མཐུ་མེད། རྒྱུ་མེད། རྐྱེན་མེད་དེ། སེམས་ཅན་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་རྒྱུ་མེད་རྐྱེན་མེད་པར་སེམས་ཅན་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་ཏེ། རྒྱུ་མེད་དོ། ། རྐྱེན་མེད་དོ། ། སེམས་ཅན་རྣམས་རྣམ་པར་དག་པ་ཡང་རྒྱུ་མེད། རྐྱེན་མེད་པར་སེམས་ཅན་རྣམ་པར་དག་གོ ། ཞེས་འདི་ལྟར་རྒྱུ་མེད་པར་ལྟ་བ་ལ་གནས་ནས། བདག་གིས་མི་དགེ་བའི་ལས་མང་པོ་མངོན་པར་འདུས་བྱས་ཏེ། ལས་དེའི་རྣམ་པར་སྨིན་པས་འདི་ལྟ་སྟེ། མིའི་ནང་དུ་སྦྱིན་གནས་ཐམས་ཅད་ཉེ་བར་འཚོ་བ་མ་ཡིན་པ། དབང་པོ་མ་ཚང་པའི་མིའི་ལུས་ཐོབ་སྟེ། དེ་ན་བདག་གླེན་པ་གཡེང་བ། དིག་པ་ལྐུགས་པ། རྨོངས་པ། བླུན་པ། ལོང་བ། འོན་པར་གྱུར་པས། གང་ཚིག་དང་། ཡི་གེ་དང་། དོན་དུ་ལྡན་པ་ནས། མྱ་ངན་ལས་འདས་པ་དང་ལྡན་པའི་བར་དུ་དེ་དག་འཛིན་པ་དང་། ལེན་པ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པའི་མཐུ་མེད་པས་འདི་ལྟ་བུའི་སྦྱིན་གནས་མཉེས་པར་མ་བྱས་སོ། ། བདག་གིས་ནི་ད་ལྟར་སྦྱིན་གནས་མཉེས་པར་བྱས་ཀྱིས། ལུས་དང་སྲོག་ལ་མི་ལྟ་བའི་བར་དུ་བྱས་ཏེ། གང་ཚིག་དང་། ཡི་གེ་དང་། དོན་དུ་ལྡན་པ་ནས་མྱ་ངན་ལས་འདས་པ་དང་ལྡན་པ་ནས་མྱ་ངན་ལས་འདས་པའི་བར་དུ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་གཟུང་བ་ནས། ཀུན་ཆུབ་པར་བྱ་བའི་བར་དུ་ནུས་ཀྱིས། འོ་ན་ད་བདག་གིས་བརྩོན་འགྲུས་བརྩམས་ཏེ། འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་བླང་བའི་ཕྱིར་ལུས་ཀྱིས་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱའོ། ། འཛིན་པ་དང་། ཀློག་པ་དང་། ཁ་ཏོན་དང་། བསྙེན་བཀུར་བྱས་ཏེ། སྙིང་པོ་མེད་པའི་ལུས་ལས་སྙིང་པོ་བླངས་པར་འགྱུར། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་ཉེ་བར་བརྟན་པར་བྱས་པར་འགྱུར་ཏེ། བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་དེས་ཉེ་བར་བརྟན་པས་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་འདི་དང་ཉེ་བར་འགྱུར་རོ་སྙམ་ནས་ཆེད་དུ་བསམས་ཏེ། སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ། ཐ་ན་ཆུ་བུམ་པ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “Furthermore, Śāriputra, the bodhisatva cultivates the following thought: ‘For a long time I had no spiritual friends. Surrounded by evil friends, I was lazy, I had little vigor, I was idle, and I was dumb. I dismissed those words and statements that were coherent, that related to the Dharma, and that were about emancipation, about what is beyond passion, and about cessation, pacification, complete awakening, asceticism, what is holy, and nirvāṇa. I learned, remembered, recited, and mastered those words and statements that were not coherent, that were not related to the Dharma, that were not about nirvāṇa, and so forth, and that professed ideas such as there being no power, no vigor, no human power, no human strength, no human endeavor, no practice, no endeavor, no endeavor in practice, the idea that there is no cause and no condition that leads to sentient beings’ afflictions, the idea that sentient beings can be afflicted without there being any causes or conditions involved, the idea that there are no causes and no conditions that lead to the purification of sentient beings, and the idea that sentient beings can be purified without causes and conditions being involved. Upholding the view that there are no causes and the view of causal incongruence, I developed many unwholesome habits, and as a result of these unwholesome habits, I had to endure states of existence in which my faculties were deficient. I ended up as a human being with no inclination to serve those who are worthy of veneration. I was born a fool, distracted, incapacitated, dull, crippled, blind, and deaf, and so I lacked the ability to understand, remember, recite, or master those words and expressions that were coherent, that were about nirvāṇa, and so forth. Indeed, in this kind of state, I had no inclination to serve those who are worthy of veneration. So now that I have attained this fortunate state, and so forth, I will, with no concern for my body or my life, strive to learn the cycle of teachings contained in The Collected Teachings on the Bodhisatva, which contains words and statements that are coherent, that are about cessation, about nirvāṇa, and so forth. I will work to master them, and so forth, and I will honor and serve the teachers. In this way, by learning, remembering, reading, reciting, and venerating the cycle of teachings contained in The Collected Teachings on the Bodhisatva, this insubstantial body will be employed in a meaningful way, and serve as a foundation for the powers of virtue and knowledge. Motivated to create a firm support for the powers of virtue and knowledge, and to develop a relationship with The Collected Teachings on the Bodhisatva, one honors and serves one’s teacher to the extent that one will even be willing to give up one’s water flask.’ “This is the eighth thought the bodhisatva cultivates, and so he honors and serves his teacher to the extent that he will even be willing to give up his water flask.”

source: ཆོས་གང་དོན་དང་ལྡན་པ་དང་། །ལམ་གྱི་ཡན་ལག་ལམ་སྒོམ་དང་། །འགོག་པ་མངོན་དུ་བྱེད་པ་དང་། །མྱ་ངན་འདས་ལམ་སྙིང་པོ་ཅན། །
en: “The Dharma is what makes good sense. It is by means of the Dharma that one makes progress on the path And attains complete cessation. The Dharma is what contains the essence of the path to nirvāṇa.

source: ཆོས་དེ་དག་ནི་ཡོངས་སྤངས་ནས གང་ཆོས་ཕན་པ་མེད་པ་དང་། །དོན་དང་ཚིག་ཏུ་མི་ལྡན་པ། །ཆོས་དེ་དག་ནི་བདག་གིས་བསྙེན། །
en: “I abandoned that Dharma And took what is useless as my dharma. I relied upon teachings That were not coherent.

source: བརྩོན་འགྲུས་དང་ནི་སྟོབས་མེད་དེ། །
en: “ ‘There is no power or vigor.

source: སྐྱེས་བུ་ཡི་ནི་མཐུ་ཡང་མེད། །
en: Human strength does not exist,

source: ཤིན་ཏུ་རྟུལ་བ་མཆོག་རྣམས་དང་། །དེ་དག་ཐམས་ཅད་མི་དམིགས་སོ། །
en: Nor does the highest form of exertion. None of these things can be conceived of.

source: སངས་རྒྱས་དང་ནི་ཆོས་ཀྱང་མེད། །
en: “ ‘There is no Buddha or Dharma,

source: ཕ་མ་མེད་པ་དེ་བཞིན་དུ། །
en: And likewise there are no mothers or fathers.

source: དཀར་པོ་དང་ནི་ནག་པོའི་ལས། །རྣམ་པར་སྨིན་པ་ཀུན་མེད་ཅེས།
en: The ripening of the fruits of previous Good and bad actions does not take place.’

source: །འདི་འདྲའི་སྡིག་པར་ལྟ་བ་དག །ཡང་དང་ཡང་དུ་བསྟེན་པས་ན། །
en: “These were the sorts of evil views That I put my trust in again and again.

source: གཅིག་ཏུ་མི་བཟད་མ་རུངས་པ། །སེམས་ཅན་དམྱལ་བར་ཡུན་རིང་གནས། །
en: Because of this, I ended up in the most dreadful And horrible state of hell for a long time.

source: དེ་བཞིན་དུད་འགྲོའི་སྐྱེ་གནས་དང་། །གཤིན་རྗེའི་འཇིག་རྟེན་སྡིག་ཅན་ཏེ། །
en: “Likewise, I took birth as an animal And in the spirit world governed by Yama.

source: ནམ་ཚེའང་མིར་ནི་སྐྱེས་གྱུར་ཀྱང་། །བླུན་ཞིང་ལྕེ་ནི་མེད་པར་འགྱུར། །
en: When I was born as a human being, I was stupid and lacked the ability to speak.

source: གཡེང་བ་དང་ནི་འོན་པར་འགྱུར། ། དིག་པ་ལྐུགས་པ་རྨོངས་པར་འགྱུར། །ཡུན་རིང་སེམས་དམྱལ་མ་རུངས་པར། །མི་ཤེས་པས་ནི་རབ་ཏུ་ལྟུང་། །
en: “I was incapacitated and deaf, Lost, crippled, and confused, And being ignorant I fell again Into the terrible hells for a long time.

source: དབང་པོ་ཐམས་ཅད་ཕུན་ཚོགས་ཤིང་། །བདག་གི་ལུས་འདི་རབ་མཛེས་པ། །ཡུན་རིང་དུས་ན་བདག་གིས་ཐོག །འདི་ནི་བདག་བརྩོན་བྱ་བའི་དུས། །
en: “But now, after a very long time, I have obtained this magnificent existence In which I have all my faculties intact—Now is the time for me to exert myself.

source: ཆོས་གང་དོན་དང་ལྡན་པ་དང་། །མྱ་ངན་འདའ་བའི་གྲོགས་བྱེད་པ། །བྱང་ཆུབ་ལམ་དང་བྱང་ཆུབ་ལ། །བདག་ནི་འབད་པར་བྱ་བའི་དུས། །
en: “Now is the time to exert myself To that Dharma that is meaningful, That helps one to approach nirvāṇa, The path of awakening, awakening itself.

source: བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ནི། །ཟབ་མོའི་དོན་དང་ལྡན་པ་སྟེ། ། བསྐལ་པ་སྟོང་ཕྲག་བྱེ་བར་ཡང་། །དེ་ནི་ཤིན་ཏུ་ཐོས་པར་དཀའ། །
en: “It is exceedingly difficult, Even in the course of a thousand million eons, To gain access to that which is most profoundly meaningful, The Collected Teachings on the Bodhisatva.

source: སངས་རྒྱས་ཀྱི་ནི་བྱང་ཆུབ་ཕྱིར། །སངས་རྒྱས་ཆོས་མང་འདི་དང་ནི། །གཞན་ཡང་བསམ་གྱིས་མི་ཁྱབ་ལ། །རབ་ཏུ་འཇུག་ཅིང་གཟུང་བར་བྱ། །
en: “To gain the awakening of a buddha, I will engage with and master This and many Of the Buddha’s other inconceivable teachings.

source: སློབ་དཔོན་ལ་ནི་གུས་བཅས་ཤིང་། །བསྙེན་བཀུར་དག་ནི་བྱས་པས་ན། ། སངས་རྒྱས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས། །ཐོས་པ་དེ་ནི་རྙེད་པར་འགྱུར། །
en: “With great reverence I will serve the teacher, And this will give me access To the learning of the buddhas and bodhisatvas.

source: བྱང་ཆུབ་སེམས་དཔའ་མི་འཇིགས་པ། །ཐབས་དང་ཤེས་རབ་ལྡན་པ་ཡི། །འདི་ལྟ་བུར་ནི་སེམས་བསྐྱེད་ནས། ། རྫ་གང་ཙམ་གྱི་ཆུ་ཡང་འབུལ། །
en: “Having reflected in this way, The undaunted bodhisatva, Accomplished in wisdom and skill, Will even give away his water flask.

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་བརྒྱད་པ་འདི་བསྐྱེད་ནས་ བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཕྱིར་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ ཐ་ན་ཆུ་རྫ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This then, Śāriputra, is the eighth thought the bodhisatva cultivates, and for the sake of The Collected Teachings on the Bodhisatva he honors and serves his teacher to the extent that he will even be willing to give up his water flask.

source: གཞན་ཡང་ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟར་སེམས་བསྐྱེད་དེ། ཀྱེ་མའོ་སེམས་ཅན་འདི་དག་ནི་དོན་མེད་པས་ཡོངས་སུ་བསྐོར་བ། ལུས་དང་སྲོག་ལ་ལྟ་བའོ། ། དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ནི་ལུས་དང་སྲོག་ལ་མི་ལྟ་བའོ། ། དོན་མེད་པས་ཡོངས་སུ་བསྐོར་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་དང་སྲོག་ལ་ལྟའི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ལ་མི་ལྟ་ཞིང་ང་ཡིར་འཛིན་པ་སྔོན་དུ་འགྲོ་བས་བདག་སྦ་བ་དང་། དྲིལ་བ་དང་། མཉེ་བ་དང་། བཀྲུ་བ་དང་། བརྫི་བས་ཡོངས་སུ་བསྐོར་བ་དེ་ནི་དོན་མེད་པས་ཡོངས་སུ་བསྐོར་བ་ཞེས་བྱའོ། ། གཞན་ཡང་དོན་མེད་པས་ཡོངས་སུ་བསྐོར་བ་ནི་འདི་ལྟ་སྟེ། ལུས་དང་སྲོག་ལ་ལྟ་ཞིང་ང་ཡི་ར་འཛིན་པ་སྔོན་དུ་འགྲོ་བས་ཆུང་མ་དང་། བུ་ཕོ་དང་། བུ་མོ་དང་། མཛའ་བོ་དང་། ཉེ་དུ་དང་། སྣག་གི་གཉེན་མཚམས་སྦེད་པ་དང་། དྲིལ་བ་ནས་ཡོ་བྱད་དང་། ལོངས་སྤྱོད་ཐམས་ཅད་ཀྱི་བར་གྱིས་ཡོངས་སུ་བསྐོར་བ་དེ་ནི་དོན་མེད་པས་ཡོངས་སུ་བསྐོར་བ་ཞེས་བྱའོ། ། གཞན་ཡང་ང་ཡིར་འཛིན་པ་སྔོན་དུ་འགྲོ་བ་ནས། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པའི་མི་སྦེད་པ་དང་། མངག་པ་དང་། ཀུན་ཏུ་སྲུང་བ་དེ་ནི་དོན་མེད་པས་ཡོངས་སུ་བསྐོར་བ་ཞེས་བྱའོ། །
en: “Furthermore, Śāriputra, the bodhisatva cultivates the following thought: ‘Alas! Sentient beings are completely caught up in meaningless activities and are far too concerned about their bodies and their lives. When one is engaged with what is meaningful, one will have no concern for one’s body or one’s life. What does being caught up in meaningless activities entail? It is to be concerned about one’s body and one’s life but to have no concern for the Dharma that leads to awakening. It is fostering the idea of ownership by being protective of one’s sense of self, being addicted to rubbing, massaging, bathing, and shampooing one’s body. This is what is meant by ‘being caught up in meaningless activities.’ Likewise, being caught up in meaningless activities is to be concerned about one’s body and one’s life but to have no concern for the Dharma that leads to awakening, fostering the idea of ownership by being protective of one’s wife, sons, daughters, friends, kinsmen, acquaintances, and relatives and being addicted to rubbing, food and drink, and so forth, and to all kinds of objects, pleasures, and possessions. This is what is meant by ‘being caught up in meaningless activities.’ Likewise, it is to foster the idea of ownership by keeping male and female servants, workers, and laborers, ordering them around and keeping them under guard. This is what is meant by ‘being caught up in meaningless activities.’

source: དེ་ལ་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་དང་སྲོག་ལ་མི་ལྟའི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ལ་ལྟ་ཞིང་བྱང་ཆུབ་ཀྱི་སེམས་སྔོན་དུ་འགྲོ་བའི་ལུས་ཀྱི་ལས་དང་། ངག་གི་ལས་དང་། ཡིད་ཀྱི་ལས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་དེ་ནི་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ཞེས་བྱའོ། །
en: “ ‘What does being engaged with what is meaningful entail? It is to have no concern for one’s body or one’s life and to be solely concerned with the Dharma that leads to awakening, fostering the mind of awakening by guarding one’s physical, verbal, and mental activity. This is what is meant by ‘being engaged with what is meaningful.’

source: གཞན་ཡང་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ནི། འདི་ལྟ་སྟེ། ལུས་དང་སྲོག་ལ་མི་ལྟའི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ལ་ལྟ་ཞིང་བྱང་ཆུབ་ཀྱི་སེམས་སྔོན་དུ་འགྲོ་བའི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒྲུབ་པ་ནས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒྲུབ་པའི་བར་གྱིས་ཡོངས་སུ་བསྐོར་བ་དེ་ནི་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ཞེས་བྱའོ། །
en: “ ‘Likewise, to be engaged with what is meaningful is to have no concern for one’s body or one’s life but to be solely concerned with the Dharma that leads to awakening, fostering the mind of awakening by being fully dedicated to becoming accomplished in the perfections, from generosity to wisdom. This is what is meant by ‘being engaged with what is meaningful.’

source: གཞན་ཡང་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ནི་ལུས་དང་སྲོག་ལ་མི་ལྟའི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ལ་ལྟ་ཞིང་བྱང་ཆུབ་ཀྱི་སེམས་སྔོན་དུ་འགྲོ་བའི་སྦྱིན་པ་དང་། སྙན་པར་སྨྲ་བ་དང་། དོན་བྱ་བ་དང་། དོན་འཐུན་པས་སེམས་ཅན་ཐམས་ཅད་སྡུད་པས་ཡོངས་སུ་བསྐོར་བ་དེ་ནི་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ཞེས་བྱའོ། །
en: “ ‘Likewise, to be engaged with what is meaningful is to have no concern for one’s body or one’s life and to be solely concerned with the Dharma that leads to awakening, fostering the mind of awakening by being generous, speaking kindly, acting for the benefit of others, and being consistent. This is what is meant by ‘being engaged with what is meaningful.’

source: གཞན་ཡང་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ནི་འདི་ལྟ་སྟེ། ལུས་དང་སྲོག་ལ་མི་ལྟའི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ལ་ལྟ་ཞིང་བྱང་ཆུབ་ཀྱི་སེམས་སྔོན་དུ་འགྲོ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་བསྒོམ་པས་ཡོངས་སུ་བསྐོར་བ་དེ་ནི་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ཞེས་བྱའོ། །
en: “ ‘Likewise, to be engaged with what is meaningful is to have no concern for one’s body or one’s life and to be solely concerned with the Dharma that leads to awakening, fostering the mind of awakening by dedicating oneself to maintaining one’s mindfulness, to proper renunciation, to the foundations of magical abilities, to the faculties, the powers, the factors of awakening, and to making progress on the path. This is what is meant by ‘being engaged with what is meaningful.’

source: གཞན་ཡང་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ནི་འདི་ལྟ་སྟེ། ལུས་དང་སྲོག་ལ་མི་ལྟའི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ལ་ལྟ་ཞིང་། བྱང་ཆུབ་ཀྱི་སེམས་སྔོན་དུ་འགྲོ་བའི་ཕ་མ་དང་། སློབ་དཔོན་ལ་རིམ་གྲོ་བྱེད་ཅིང་བླ་མའི་གནས་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་། འདུད་པ་དང་། རབ་ཏུ་འདུད་པ་དང་། གུས་པར་སྨྲ་བ་དང་། ཕྱག་འཚལ་བ་དང་། ལྡང་བ་དང་། ཐལ་མོ་སྦྱོར་བའི་ལས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་དེ་ནི་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ཞེས་བྱའོ། །
en: “ ‘Likewise, to be engaged with what is meaningful is to have no concern for one’s body or one’s life but to be solely concerned with the Dharma that leads to awakening, fostering the mind of awakening with full dedication toward serving one’s parents and teachers and toward serving, attending, venerating, prostrating to, worshiping, praising, welcoming, and saluting one’s guru and addressing him with respect. This is what is meant by ‘being engaged with what is meaningful.’

source: གཞན་ཡང་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བ་ནི་འདི་ལྟ་སྟེ། ལུས་དང་སྲོག་ལ་མི་ལྟའི། བྱང་ཆུབ་ཕྱོགས་ཀྱི་ཆོས་ལ་ལྟ་ཞིང་བྱང་ཆུབ་ཀྱི་སེམས་སྔོན་དུ་འགྲོ་བའི་དཀོན་མཆོག་གསུམ་གྱི་ཞལ་ཏུ་བྱས་པས་ཡོངས་སུ་བསྐོར་བའོ། ། དེ་ལྟར་ཀྱེ་མའོ་སེམས་ཅན་འདི་དག་ནི་དོན་མེད་པས་ཡོངས་སུ་བསྐོར་བ། ལུས་དང་སྲོག་ལ་ལྟ་བའོ། ། ཀྱེ་མའོ་བདག་ནི་དོན་གྱིས་ཡོངས་སུ་བསྐོར་བས་ཡོངས་སུ་བསྐོར་གྱི་བདག་ད་བརྩོན་འགྲུས་བརྩམས་ལ་སློབ་དཔོན་ལ་ལུས་ཀྱིས་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱ་སྟེ། དེ་ལྟར་ན་སྙིང་པོ་མེད་པའི་ལུས་ལས་སྙིང་པོ་བླངས་པ་དང་། བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་ཉེ་བར་བརྟན་པར་བྱས་པར་འགྱུར་ཏེ།
en: “ ‘Likewise, to be engaged with what is meaningful is to have no concern for one’s body or one’s life but to be solely concerned with the Dharma that leads to awakening, fostering the mind of awakening by being fully dedicated to serving the Three Jewels. One thinks, “Alas! Completely caught up in meaningless activities, these sentient beings’ sole concern is for their own bodies and their own lives. I must therefore engage with what is meaningful and apply myself to this endeavor with vigor. I will honor and serve my teacher. In this way, this insubstantial body will be used in a meaningful way, and a foundation for the powers of virtue and knowledge will be developed. With the support of the powers of virtue and knowledge, I will be brought closer to the seat of awakening.” ’

source: བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་སྟོབས་དེས་ཉེ་བར་བརྟན་པས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་དང་ཉེ་བར་འགྱུར་རོ་སྙམ་པ་དེ་ནི་ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་དགུ་པ་འདི་བསྐྱེད་ནས་ སློབ་དཔོན་ལ་རིམ་གྲོ་དང་བསྙེན་བཀུར་བྱེད་དེ ཐ་ན་ཆུ་རྫ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This is the ninth thought the bodhisatva cultivates, and so for the sake of The Collected Teachings on the Bodhisatva he honors and serves his teacher to the extent that he will even be willing to give up his water flask.”

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཀུན། །ལུས་དང་སྲོག་ལ་ལྟ་ལྡན་ཞིང་། །
en: “All immature ordinary beings Are only concerned with their bodies and their lives.

source: བྱང་ཆུབ་ཕྱོགས་ལ་མི་ལྟ་སྟེ། ། རྣམ་པ་སྣ་ཚོགས་ལས་ཀྱང་བྱེད། །
en: They are not concerned with what leads to awakening, And they engage in all kinds of activities.

source: སོ་སོའི་སྐྱེ་བོ་དེ་དག་ནི། །བདག་གི་དོན་དང་ཆུང་མའི་དོན། །བུ་ཕོ་དང་ནི་བུ་མོའི་ཕྱིར། །དོན་མེད་པ་ལ་ཆགས་པར་འགྱུར། །
en: “For their own benefit and that of their wives, With their sons and daughters in mind, Ordinary beings greedily Pursue their meaningless goals.

source: བྲན་དང་ལས་བྱེད་མངག་པ་དག །མི་མཁས་པས་ནི་ཀུན་ཏུ་མངགས། །
en: “The ignorant order their servants, Workers, and laborers about.

source: རྐང་བཞི་པ་དག་གསོ་བྱེད་དེ། ། དེ་དག་དོན་མེད་ཆགས་པར་འགྱུར། །
en: By raising livestock, They pursue their meaningless goals.

source: ནོར་དང་འབྲུ་རྣམས་རབ་སོགས་ཤིང་། །སྦྱིན་པ་མི་བྱེད་མི་སྤྱོད་དེ། །
en: “They amass wealth and riches, But they are not generous, and they do not make good use of it.

source: དོན་མེད་ཆགས་པ་དེ་དག་ནི། །གཏེར་གྱི་སྲུངས་མར་བརྗོད་པ་ཡིན། །
en: Pursuing their meaningless goals, They become known as guardians of treasure.

source: འདི་ནི་དོན་མེད་ཆགས་པ་སྟེ། ། སོ་སོའི་སྐྱེ་བོ་དེ་ལ་ཆགས། །
en: “This is what ordinary beings are like, Addicted to pursuing meaningless goals.

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་ལྡན་ནི། །དོན་ལ་ཆགས་ཤིང་བརྩོན་པར་བྱེད། །
en: Those who have wisdom, the bodhisatvas, Persevere in their pursuit of what is meaningful.

source: ལུས་དང་སྲོག་ལ་མི་ལྟ་ཡི། །བྱང་ཆུབ་ཕྱོགས་ལ་ལྟ་བྱེད་ཅིང་། །རྣམ་པ་སྣ་ཚོགས་ལས་བྱེད་པ། །དོན་ལ་ཡོངས་སུ་ཆགས་ཤེས་བྱ། །
en: “They have no concern for their bodies or their lives And are only concerned with what leads to awakening. In all the different activities they carry out, They are known as those who pursue what is meaningful.

source: སྦྱིན་དང་ཚུལ་ཁྲིམས་བརྩོན་འགྲུས་བཟོད། །བསམ་གཏན་ཤེས་རབ་དེ་བཞིན་དུ། །ཐབས་དང་རབ་ཏུ་ལྡན་པ་ནི། །དོན་ལ་ཡོངས་སུ་ཆགས་ཞེས་བྱ། །
en: “They engage skillfully with generosity, Morality, patience, vigor, Meditation, and wisdom. They are known as those who pursue what is meaningful.

source: ཕ་དང་མ་ལ་བསྙེན་བཀུར་བྱེད། །
en: “They serve their mothers and their fathers.

source: བླ་མ་རྒན་རབས་རྗེས་སུ་བསྐྱངས།
en: They cherish their gurus and their elders.

source: །དཀོན་མཆོག་གསུམ་གྱི་ཞལ་ཏ་བྱེད། ། དོན་ལ་ཡོངས་སུ་ཆགས་ཞེས་བྱ། །
en: They serve the Three Jewels, And they are known as those who pursue what is meaningful.

source: ཆོས་ཀུན་ཡང་དག་བསྡུས་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་འདི། །ཀློག་ཅིང་རབ་ཏུ་སྟོན་པ་ནི། །དོན་ལ་ཡོངས་སུ་ཆགས་ཞེས་བྱ། །
en: “They have grasped all the teachings In The Collection of Teachings on the Bodhisatva. They recite it and elucidate it And are known as those who pursue what is meaningful.

source: དོན་ལ་ཆགས་པ་དེ་དག་ནི། །སངས་རྒྱས་ཀུན་གྱིས་བསྔགས་པ་སྟེ། །
en: “These meaningful pursuits Are praised by all the buddhas.

source: དེ་ལ་བརྩོན་དང་ལྡན་པ་ནི། །རྒྱལ་སྲས་འཇིགས་པ་མེད་པའོ། །
en: The sons of the Victorious One Apply themselves to these pursuits with skill.

source: དེ་ལྟ་བུ་ཡི་སེམས་བསྐྱེད་ནས། །རབ་ཏུ་དད་པའི་སེམས་ཀྱིས་ནི། །བླ་མ་རྣམས་ལ་བསྙེན་བཀུར་བྱེད། །སྣོད་གང་ཙམ་གྱི་ཆུ་ཡང་འབུལ། །
en: “Having cultivated this thought, He serves his gurus With the greatest devotion And will even be willing to give away his water flask.

source: ཤཱ་རིའི་བུ་སེམས་བསྐྱེད་པ་དགུ་པ་འདི་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་ཀྱི་ཕྱིར་སློབ་དཔོན་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱེད་དེ་ཐ་ན་ཆུ་བུམ་པ་གང་ཙམ་ཡང་འབུལ་ལོ། །
en: “This then, Śāriputra, is the ninth thought the bodhisatva cultivates, and for the sake of The Collected Teachings on the Bodhisatva, he honors and serves his teacher to the extent that he will even be willing to give up his water flask.
